Given an array of integers nums and an integer target, return indices of the two numbers such that they add up to target.

You may assume that each input would have exactly one solution, and you may not use the same element twice.

You can return the answer in any order.

 

Example 1:

Input: nums = [2,7,11,15], target = 9
Output: [0,1]
Explanation: Because nums[0] + nums[1] == 9, we return [0, 1].
Example 2:

Input: nums = [3,2,4], target = 6
Output: [1,2]
Example 3:

Input: nums = [3,3], target = 6
Output: [0,1]
 

Constraints:
Only one valid answer exists.

In [8]:
def test_case(nums:list, target:int)-> list:
    for i in range(len(nums)):#[2,7,11,15]
        for j in range(i+1,len(nums)):#[2,7,11,15]
            if nums[i]+nums[j] == target:
                break
        break

    return(i,j)

In [6]:
nums = [2,7,11,15]
target = 9
#Output: [0,1]
print(test_case(nums=nums, target=target))

(0, 1)

In [9]:
nums = [3,2,4]
target = 6
#Output: [0,1]
print(test_case(nums=nums, target=target))

(0, 2)

In [10]:
nums = [3,3]
target = 6
#Output: [0,1]
print(test_case(nums=nums, target=target))

(0, 1)

In [11]:
import pandas as pd

In [17]:
data = {"col1": [1,2,3,4,5,6], "col2":[1,4,9,16,25,None], "col3":["mumbai", "delhi", "bangalore", "pune", "hyderabad", "chennai"]}

In [19]:
df = pd.DataFrame(data=data)

In [20]:
df

   col1  col2       col3
0     1   1.0     mumbai
1     2   4.0      delhi
2     3   9.0  bangalore
3     4  16.0       pune
4     5  25.0  hyderabad
5     6   NaN    chennai

In [21]:
type(df)

pandas.core.frame.DataFrame

In [22]:
# head() - first 5 rows
df.head()

   col1  col2       col3
0     1   1.0     mumbai
1     2   4.0      delhi
2     3   9.0  bangalore
3     4  16.0       pune
4     5  25.0  hyderabad

In [23]:
# tail() - last 5 rows
df.tail()

   col1  col2       col3
1     2   4.0      delhi
2     3   9.0  bangalore
3     4  16.0       pune
4     5  25.0  hyderabad
5     6   NaN    chennai

In [24]:
df.head(2)

   col1  col2    col3
0     1   1.0  mumbai
1     2   4.0   delhi

In [25]:
df.head(3)

   col1  col2       col3
0     1   1.0     mumbai
1     2   4.0      delhi
2     3   9.0  bangalore

In [26]:
df.tail(2)

   col1  col2       col3
4     5  25.0  hyderabad
5     6   NaN    chennai

In [27]:
df.tail(4)

   col1  col2       col3
2     3   9.0  bangalore
3     4  16.0       pune
4     5  25.0  hyderabad
5     6   NaN    chennai

In [28]:
#shape - (rows, columns)
df.shape

(6, 3)

In [29]:
# info()
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   col1    6 non-null      int64
 1   col2    5 non-null      float64
 2   col3    6 non-null      object
dtypes: float64(1), int64(1), object(1)
memory usage: 272.0+ bytes

In [47]:
# dtypes - data type of each column
df.dtypes

col1      int64
col2    float64
col3     object
dtype: object

In [32]:
df

   col1  col2       col3
0     1   1.0     mumbai
1     2   4.0      delhi
2     3   9.0  bangalore
3     4  16.0       pune
4     5  25.0  hyderabad
5     6   NaN    chennai

In [33]:
# dataframe['columnname']

df['col1']

0    1
1    2
2    3
3    4
4    5
5    6
Name: col1, dtype: int64

In [34]:
type(df['col1'])

pandas.core.series.Series

In [35]:
df[['col1']]

   col1
0     1
1     2
2     3
3     4
4     5
5     6

In [36]:
type(df[['col1']])

pandas.core.frame.DataFrame

In [43]:
df.col1

0    1
1    2
2    3
3    4
4    5
5    6
Name: col1, dtype: int64

In [39]:
# Read multiple columns
df[['col1', 'col2']]

   col1  col2
0     1   1.0
1     2   4.0
2     3   9.0
3     4  16.0
4     5  25.0
5     6   NaN

In [48]:
df

   col1  col2       col3
0     1   1.0     mumbai
1     2   4.0      delhi
2     3   9.0  bangalore
3     4  16.0       pune
4     5  25.0  hyderabad
5     6   NaN    chennai

#### Filter out the data where col2 < 9

In [49]:
df.head(2)

   col1  col2    col3
0     1   1.0  mumbai
1     2   4.0   delhi

In [53]:
df['col2']

0     1.0
1     4.0
2     9.0
3    16.0
4    25.0
5     NaN
Name: col2, dtype: float64

In [52]:
df['col2']<9

0     True
1     True
2    False
3    False
4    False
5    False
Name: col2, dtype: bool

In [57]:
condition = 16
df[df['col2']<=condition]

   col1  col2       col3
0     1   1.0     mumbai
1     2   4.0      delhi
2     3   9.0  bangalore
3     4  16.0       pune

In [60]:
df

   col1  col2       col3
0     1   1.0     mumbai
1     2   4.0      delhi
2     3   9.0  bangalore
3     4  16.0       pune
4     5  25.0  hyderabad
5     6   NaN    chennai

In [58]:
df['col3']

0       mumbai
1        delhi
2    bangalore
3         pune
4    hyderabad
5      chennai
Name: col3, dtype: object

In [72]:
df['col3']<'delhi'

0    False
1    False
2     True
3    False
4    False
5     True
Name: col3, dtype: bool

In [86]:
condition = 'delhi'
df[df['col3']<condition]

   col1  col2       col3
2     3   9.0  bangalore
5     6   NaN    chennai

In [87]:
df

   col1  col2       col3
0     1   1.0     mumbai
1     2   4.0      delhi
2     3   9.0  bangalore
3     4  16.0       pune
4     5  25.0  hyderabad
5     6   NaN    chennai

In [88]:
# add a new column
df['col4'] = [1,8,27,64,125,256]

In [89]:
df

   col1  col2       col3  col4
0     1   1.0     mumbai     1
1     2   4.0      delhi     8
2     3   9.0  bangalore    27
3     4  16.0       pune    64
4     5  25.0  hyderabad   125
5     6   NaN    chennai   256

In [93]:
# add a derived column
df['col5'] = df['col1']**3

In [94]:
df

   col1  col2       col3  col4  col5
0     1   1.0     mumbai     1     1
1     2   4.0      delhi     8     8
2     3   9.0  bangalore    27    27
3     4  16.0       pune    64    64
4     5  25.0  hyderabad   125   125
5     6   NaN    chennai   256   216

In [69]:
y = ['apple','zebra','Apple', 'Zebra','ball','delhi', 'cat', 'pet']
y

['apple', 'zebra', 'Apple', 'Zebra', 'ball', 'delhi', 'cat', 'pet']

In [70]:
y.sort()

In [71]:
y

['Apple', 'Zebra', 'apple', 'ball', 'cat', 'delhi', 'pet', 'zebra']

In [63]:
z = [12,3,4,5,1,2]

In [64]:
z.sort()

In [65]:
z

[1, 2, 3, 4, 5, 12]

In [77]:
len(df)

6